# ConstraintFixedOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ConstraintFixedOffset Property
ParameterTypeId Class See Also
---
"Fixed offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ConstraintFixedOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConstraintFixedOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ConstraintFixedOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace